IRP/src/InformationRegisters/T9068S_AccountingMappingAccountsMatching/T9068S_AccountingMappingAccountsMatching.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9068S_AccountingMappingAccountsMatching</name>
 <resources>
  <name>TargetAccount</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <attributes>
  <name>AllExtDimensionValues1</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AllExtDimensionValues2</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AllExtDimensionValues3</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <dimensions>
  <name>IntegrationSettings</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SourceLedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TargetLedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SourceAccount</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExtDimensionType1</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExtDimensionValue1</name>
  <type>
   <types>Characteristic.AccountingExtraDimensionTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExtDimensionType2</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExtDimensionValue2</name>
  <type>
   <types>Characteristic.AccountingExtraDimensionTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExtDimensionType3</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExtDimensionValue3</name>
  <type>
   <types>Characteristic.AccountingExtraDimensionTypes</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9068S_AccountingMappingAccountsMatching/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnReadAtServer(CurrentObject)
	If ValueIsFilled(Record.SourceLedgerType) Then
		ThisObject.SourceLedgerTypeVariant = Record.SourceLedgerType.LedgerTypeVariant;
	EndIf;

	If ValueIsFilled(Record.TargetLedgerType) Then
		ThisObject.TargetLedgerTypeVariant = Record.TargetLedgerType.LedgerTypeVariant;
	EndIf;

	SetVisible();
EndProcedure

&AtClient
Procedure SourceAccountOnChange(Item)
	SourceAccountOnChangeAtServer();
EndProcedure

&AtServer
Procedure SourceAccountOnChangeAtServer()
	If Not ValueIsFilled(Record.SourceAccount) Then
		Record.ExtDimensionType1 = Undefined;
		Record.ExtDimensionType2 = Undefined;
		Record.ExtDimensionType3 = Undefined;
		
		Record.ExtDimensionValue1 = Undefined;
		Record.ExtDimensionValue2 = Undefined;
		Record.ExtDimensionValue3 = Undefined;
		
		Record.AllExtDimensionValues1 = False;
		Record.AllExtDimensionValues2 = False;
		Record.AllExtDimensionValues3 = False;
		
		SetVisible();
		Return;
	EndIf;
	
	For i = 0 To 2 Do
		If Record.SourceAccount.ExtDimensionTypes.Count() > i Then
			Record["ExtDimensionType" +  String(i + 1)] = Record.SourceAccount.ExtDimensionTypes[i].ExtDimensionType;
		Else
			Record["ExtDimensionType" +  String(i + 1)] = Undefined;
		EndIf;
	EndDo;
	SetVisible();
EndProcedure

&AtClient
Procedure SourceLedgerTypeOnChange(Item)
	SourceLedgerTypeOnChangeAtServer();
EndProcedure

&AtServer
Procedure SourceLedgerTypeOnChangeAtServer()
	If ValueIsFilled(Record.SourceLedgerType) Then
		ThisObject.SourceLedgerTypeVariant = Record.SourceLedgerType.LedgerTypeVariant;
		If Record.SourceAccount.LedgerTypeVariant <> ThisObject.SourceLedgerTypeVariant Then
			Record.SourceAccount = Undefined;
		EndIf;
	Else
		ThisObject.SourceLedgerTypeVariant = Undefined;
		Record.SourceAccount = Undefined;
	EndIf;
	SourceAccountOnChangeAtServer();
EndProcedure

&AtClient
Procedure TargetLedgerTypeOnChange(Item)
	TargetLedgerTypeOnChangeAtServer();
EndProcedure

&AtServer
Procedure TargetLedgerTypeOnChangeAtServer()
	If ValueIsFilled(Record.TargetLedgerType) Then
		ThisObject.TargetLedgerTypeVariant = Record.TargetLedgerType.LedgerTypeVariant;
		If Record.TargetAccount.LedgerTypeVariant <> ThisObject.TargetLedgerTypeVariant Then
			Record.TargetAccount = Undefined;
		EndIf;
		
	Else
		ThisObject.TargetLedgerTypeVariant = Undefined;
		Record.TargetAccount = Undefined;
	EndIf;
	SetVisible();
EndProcedure

&AtClient
Procedure AllExtDimensionValues1OnChange(Item)
	Record.ExtDimensionValue1 = Undefined;
	SetVisible();
EndProcedure

&AtClient
Procedure AllExtDimensionValues2OnChange(Item)
	Record.ExtDimensionValue2 = Undefined;
	SetVisible();
EndProcedure

&AtClient
Procedure AllExtDimensionValues3OnChange(Item)
	Record.ExtDimensionValue3 = Undefined;
	SetVisible();
EndProcedure

&AtServer
Procedure SetVisible()
	Items.ExtDimensionValue1.ReadOnly = Record.AllExtDimensionValues1 Or Not ValueIsFilled(Record.ExtDimensionType1);
	Items.ExtDimensionValue2.ReadOnly = Record.AllExtDimensionValues2 Or Not ValueIsFilled(Record.ExtDimensionType2);
	Items.ExtDimensionValue3.ReadOnly = Record.AllExtDimensionValues3 Or Not ValueIsFilled(Record.ExtDimensionType3);
EndProcedure
